{
  "degree": "Bachelor of Science (B.S.) in Computer Information Systems",
  "university": "Post University",
  "location": "Waterbury, CT",
  "graduation_dates": "2020 – 2022",
  "honors": [
    "President's List (GPA 3.5+)",
    "National Society of Leadership and Success"
  ],
  "additional_education": [
    {
      "degree": "Master of Business Administration",
      "university": "Western Governors University",
      "location": "Millcreek, UT",
      "estimated_graduation": "07/30/2027"
    }
  ],
  "awards": [
    "President's List: By achieving and maintaining a GPA of 3.5 or greater (2020-2022)",
    "Excellence Award: Managing Organizations and Leading People (2023)"
  ],
  "years_experience": 10,
  "professional_summary": "Results-driven Manufacturing & Supply Chain Engineer with 10+ years optimizing production systems, leading NPI scale-up initiatives, and implementing Lean Six Sigma process improvements. Proven track record: 300% production throughput increase, 50% testing efficiency gains, 20% error reduction, and 15% downtime reduction. Subject matter expert in cross-functional collaboration, CAPEX planning, and translating business requirements into scalable manufacturing solutions while maintaining regulatory compliance.",
  "alternative_summaries": [
    "Results-driven technical leader with expertise in engineering, documentation standardization, and process improvement within aerospace and manufacturing environments. Proven ability to lead cross-functional teams, optimize technical workflows, and drive operational efficiency. Adept at technical writing, training, and mentoring, with a strong focus on clarity, compliance, and process improvement.",
    "Bachelor Of Science professional with 10+ years driving Manufacturing, Solar, and Quality targeting Production Manager. Recognized for translating operational objectives into measurable gains through data-driven improvement, cross-functional leadership, and disciplined execution.",
    "Highly motivated recent University Computer Information Systems bachelor's degree program graduate. Proficient in Microsoft Office Suite, G Suite, task management, scheduling, effective communication, and problem-solving."
  ],
  "skills": [
    "and data analysis",
    "Assembly and Standardization Engineer with over a decade of expertise in engineering and documentation standardization",
    "problem-solving",
    "with a passion for fostering collaboration and continuous improvement."
  ],
  "technologies": [],
  "technical_skills_categories": {
    "Manufacturing_Excellence": [
      "NPI Integration & Scale-Up",
      "Process Optimization",
      "Production Throughput Enhancement",
      "Manufacturing Process Design",
      "Equipment Validation & Testing",
      "Assembly Procedures",
      "Streamlining Assembly Procedures",
      "Space Flight Valve Production",
      "Field-Simulation Testing",
      "Aerospace Assembly Engineering",
      "Aircraft Subsystem Assembly",
      "Manufacturing"
    ],
    "Quality_and_Compliance": [
      "Customer Complaint Resolution",
      "Cost of Poor Quality Reduction",
      "Quality Assurance Protocols",
      "Regulatory Compliance (Aerospace)",
      "Technical Documentation Standards",
      "Hardware Inspection",
      "Quality Assurance (QA) for Engineering Products"
    ],
    "Process_Engineering": [
      "Lean Six Sigma Methodologies",
      "Value Stream Mapping",
      "Root Cause Analysis",
      "Process Standardization (SOPs)",
      "Automation & Workflow Optimization",
      "Automation",
      "Algorithmic Solutions for Workflow Streamlining",
      "Technical Workflow Optimization"
    ],
    "Technical_Leadership": [
      "Cross-Functional Team Collaboration",
      "Subject Matter Expertise (Assembly/Testing)",
      "Technical Training & Mentoring",
      "Stakeholder Communication",
      "Project Management",
      "Coordination Across Departments"
    ],
    "Systems_and_Technology": [
      "ERP Systems (Aurora, Dynamics 365)",
      "CAPEX Planning & Equipment Design Support",
      "Microsoft Office Suite (Advanced)",
      "Data Analysis & Reporting",
      "New Technology Adoption",
      "Data Analysis for Maintenance Support"
    ],
    "Aerospace_and_Military": [
      "Apache Helicopter Maintenance",
      "Aircraft Systems Inspection",
      "Hydraulics",
      "Electrical Systems",
      "Flight Controls",
      "Rotor Systems",
      "Engine Components",
      "Avionics Equipment",
      "Maintenance Checks and Inspections"
    ],
    "Technical_Writing": [
      "SOP Development",
      "User Manuals",
      "Training Modules",
      "Technical Reports",
      "Engineering Documentation Review and Revision",
      "Documentation Refinement"
    ],
    "Specialized_Skills": [
      "Specialized Tooling Design",
      "Equipment Design",
      "Supply Chain Support",
      "Behavioral Observation Process (BOP) Leadership",
      "Continuous Improvement System (CIS) Leadership"
    ]
  },
  "methodologies": [
    "Lean Six Sigma",
    "Value Stream Mapping",
    "Root Cause Analysis",
    "Continuous Improvement System (CIS)",
    "Behavioral Observation Process (BOP)",
    "Gap Analysis",
    "Process Mapping"
  ],
  "achievements": [],
  "certifications": [],
  "military_service": {
    "branch": "U.S. Army National Guard",
    "dates": "Oct 2012 – Aug 2015",
    "mos": "15R Apache Repairer",
    "responsibilities": [
      "Performed maintenance, troubleshooting, and repairs on AH-64 Apache attack helicopters to keep them flight-ready",
      "Conducted inspections of aircraft systems including engines, hydraulics, electrical, flight controls, and rotor systems to identify needed repairs",
      "Replaced defective parts including gearboxes, engine components, flight control actuators, and avionics equipment",
      "Followed maintenance manuals, schematics, and publications to complete repairs according to Army regulations",
      "Used diagnostic equipment and tools to pinpoint malfunctions and errors",
      "Maintained maintenance records and documentation for each aircraft serviced",
      "Participated in training to stay current on Apache maintenance procedures and techniques",
      "Coordinated with pilots and other maintenance personnel to manage aircraft servicing schedule",
      "Ensured work areas and tools were properly cleaned and organized to maintain safety and efficiency",
      "Completed maintenance tasks within strict time constraints to meet flight schedule demands"
    ]
  },
  "clearance": "Eligible for security clearance (aerospace industry background)",
  "location_preference": "",
  "travel_ok": true,
  "relocation_ok": true,
  "relocation_statement": "Open to relocation to Maplewood, MN or other locations",
  "travel_statement": "Available for up to 15% travel as required",
  "interests": [
    "Technology Innovation",
    "Process Optimization",
    "Aerospace Assembly Engineering",
    "Leadership Development"
  ],
  "summary": "Assembly and Standardization Engineer with over a decade of expertise in engineering and documentation standardization, excelling in aerospace and manufacturing sectors. Demonstrates a visionary approach to optimizing technical workflows and enhancing operational efficiency through innovative solutions and cross-functional leadership. Skilled in communication, problem-solving, and data analysis, with a passion for fostering collaboration and continuous improvement. Employment history Assembly & Standardization Engineer / Lead Technical Writer, Jan 2024 - Aug 2025 FLSmidth, Tucson, AZ Spearheaded the transition from Aurora ERP CRM to Dynamics 365, enhancing system efficiency and user adoption. Standardized technical documentation, improving clarity and reducing errors by 20% across departments. Delegated and supervised tasks for a team of four technical writers, ensuring 95% on-time deliverables. Conducted comprehensive training sessions, elevating documentation quality and compliance company-wide. Managed integration of new software tools, increasing productivity and streamlining collaboration. Mentored technical writers, fostering a high-performance and collaborative environment. Evaluated existing workflows to identify bottlenecks, implementing targeted solutions that yielded measurable improvements in efficiency. Initiated a feedback system for documentation reviews, fostering continuous improvement and ensuring alignment with user needs. Promoted a culture of knowledge sharing among team members, enhancing collaboration and driving team morale. Aerospace Engineering Technician, Nov 2019 - Jul 2022 Jansen Aircraft System Control, Tempe, AZ Enhanced testing protocols, improving efficiency by 50% and reducing errors through automation. Streamlined valve production, cutting time by 300% and refining technical documentation for clarity. Facilitated cross-department collaboration, optimizing supply chain processes and training technicians. Analyzed production workflows, identifying bottlenecks that resulted in a marked reduction in downtime and enhanced operational efficiency. Fostered teamwork between engineering and production teams, successfully minimizing errors and improving project turnaround times. Spearheaded the integration of advanced simulation software, enhancing design validation processes and reducing time-to-market for new products. Provided mentorship to junior technicians, fostering a culture of continuous learning and improving team skill sets. Aerospace Assembly Technician II, Jul 2015 - Nov 2019 Honeywell, Phoenix, AZ Developed SOPs, enhancing documentation clarity and operational consistency. Trained new hires, ensuring adherence to quality standards and safety protocols. Led process enhancements, boosting efficiency and reducing defect rates. Executed hardware inspections, reinforcing quality assurance measures. Designed tooling solutions, contributing to defect reduction efforts. Led initiatives to streamline assembly processes, achieving measurable improvements in production speed and reducing error rates significantly. Education Bachelor of Science (B.S.) in Computer Information Systems, 2020 - 2022 Post University, Waterbury, CT Graduated Magna Cum Laude Skills Microsoft Office (Experienced), G Suite (Experienced), Technical Writing (Experienced), Data Analysis (Skillful), Troubleshooting (Skillful), Risk Management (Skillful), Problem-Solving (Experienced), Communication (Expert), Critical Thinking (Expert), Analytical Thinking (Expert), Task Management (Expert). Links LinkedIn: linkedin.com, My Website: prismwriting.com Additional information Leadership & Activities, National Society of Leadership and Success Remote Member, 2021 Recognized for leadership skills and commitment to professional development. Completed leadership training, networking, and community service projects. Languages English (Native), Russian (Proficient)."
}