{
  "degree": "Bachelor Of Science",
  "years_experience": 10,
  "skills": [
    "Analytical Thinking",
    "Communication",
    "Critical Thinking",
    "Data Analysis",
    "G Suite",
    "Risk Management",
    "Task Management",
    "Troubleshooting",
    "and mentoring skills",
    "attention to detail",
    "automation",
    "communication",
    "documentation standardization",
    "equipment",
    "implement new technologies",
    "manufacturing",
    "safety processes",
    "technical documentation"
  ],
  "technologies": [
    "automation",
    "equipment",
    "manufacturing"
  ],
  "methodologies": [],
  "achievements": [
    "Improved production time of space flight valves by 300% and enhanced hardware testing results by 50%.",
    "Improved production time of space flight valves by 300%.",
    "* Improved production time of two human-rated space flight valves by 300%.",
    "* Improved hardware field-simulation testing results by over 50%.",
    "I led the transition of ERP platforms and managed a team of writers to deliver error-reducing, department-wide documentation improvements—over 20% fewer errors reported in R&D and measurable gains across manufacturing KPIs, including a 10x reduction in assembly times and a 3x drop in bench testing cycles. My process involves direct collaboration with subject matter experts, process mapping, iterative review cycles, adoption of new documentation tools, and hands-on mentoring. I produce SOPs, user manuals, training modules, and technical reports, prioritizing clarity, compliance, and end-user knowledge transfer in every deliverable.",
    "Improved production time of two human-related space flight valves by 300%.",
    "Improved hardware field-simulation testing results by over 50%.",
    "Enhanced hardware testing efficiency by 50% with optimized assembly protocols.",
    "Improved production time of space flight valves by 300% through streamlined testing procedures.",
    "•Improved production time of two human-related space flight valves by 300%.",
    "•Improved hardware field-simulation testing results by over 50%.",
    "•  Implemented safety protocols that increased workplace compliance by 20%",
    "documentation practices, which increased process efficiency by 20%. With a background in engineering and",
    "•  Reduced downtime by 15% through detailed inspections and troubleshooting of systems.",
    "•  Implemented safety protocols that increased compliance by 20%.",
    "• Improved production time of space flight valves by 300%.",
    "● Enhanced hardware testing efficiency by 50%  with optimized assembly  protocols.",
    "● Improved production time of space flight valves by 300% through streamlined testing procedures ."
  ],
  "location_preference": "",
  "travel_ok": true,
  "relocation_ok": true
}